---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.GetEnumerator
source: html/74be3d37-1531-4986-ac1b-ece7c0068e34.htm
---
# Autodesk.Revit.DB.ReferencePointArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.